Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
Data = [4,8,15,16,23,42]

In [3]:
Series = pd.Series(Data)

In [4]:
Series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [6]:
list = [1,2,3,4,5,6,7,8,9,10]

In [7]:
series = pd.Series(list)

In [8]:
series

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female

Then, print the DataFrame.

In [9]:
data = {'Name':['Alice', 'Bob', 'Charlie'],
       'Age' : [25,30,37], 
       'Gender' : ['Female', 'Male', 'Female']}

In [11]:
df = pd.DataFrame(data)

In [12]:
df

      Name  Age  Gender
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   37  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Answer 4. In Pandas, a Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, etc.) while a DataFrame is a two-dimensional labeled data structure with columns of potentially different types. A DataFrame can be thought of as a collection of Series objects that share the same index. 

Examples are illustrated below.

In [13]:
list = [1,2,3,4,5,6,7,8,9,10]
series = pd.Series(list)
print(series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [14]:
data = {'Name':['Alice', 'Bob', 'Charlie'],
       'Age' : [25,30,37], 
       'Gender' : ['Female', 'Male', 'Female']}
df = pd.DataFrame(data)
print(df)

      Name  Age  Gender
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   37  Female

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Answer 5. There are many functions available in Pandas for manipulating data in a DataFrame. Here are some of the most commonly used functions:

1. head(): returns the first n rows of the DataFrame (default n=5).

2. tail(): returns the last n rows of the DataFrame (default n=5).

3. info(): provides a concise summary of the DataFrame, including column names, data types, and number of non-null values.

4. describe(): generates descriptive statistics of the DataFrame, such as count, mean, standard deviation, minimum and maximum values, and quartiles.

5. groupby(): groups the DataFrame by one or more columns and applies a function to each group.

6. drop(): drops specified labels (rows or columns) from the DataFrame.

7. fillna(): fills missing values in the DataFrame with a specified value or method.

8. apply(): applies a function to each element of the DataFrame.

9. sort_values(): sorts the DataFrame by one or more columns.


Example of Groupby() is illustrated below.

In [19]:
data = {'Month': ['Jan', 'Jan', 'Feb', 'Feb', 'Mar', 'Mar'],
        'Product': ['A', 'B', 'A', 'B', 'A', 'B'],
        'Revenue': [1000, 2000, 1500, 2500, 1200, 1800]}

In [21]:
df = pd.DataFrame(data)

In [23]:
revenue_month_by = df.groupby('Month')['Revenue'].sum()

In [24]:
revenue_month_by

Month
Feb    4000
Jan    3000
Mar    3000
Name: Revenue, dtype: int64

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Answer 6 - Both Series and DataFrame are mutable in nature, while Panel is considered deprecated and no longer recommended for use.

In pandas, mutable means that the object can be modified in place without creating a new object. For example, we can change the values in a Series or DataFrame without having to create a new Series or DataFrame object.

However, it is important to note that some operations on a DataFrame or Series may return a new object, rather than modifying the original object in place. For example, calling the drop() method on a DataFrame returns a new DataFrame with the specified rows or columns removed, rather than modifying the original DataFrame in place.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [27]:
s1 = pd.Series([8,99, 100, 5000,50000], name = 'X' )
s2 = pd.Series([90,60,30,45,90], name = 'Y') 
s3 = pd.Series(['a', 'b', 'c', 'd', 'e'], name = 'Z')

In [29]:
df = pd.DataFrame({'Column_A': s1, 'Column_B': s2, 'Column_C':s3})

In [30]:
df

   Column_A  Column_B Column_C
0         8        90        a
1        99        60        b
2       100        30        c
3      5000        45        d
4     50000        90        e

In the above example, I have created three Series objects named s1, s2, and s3. Then passed a dictionary with the column names as keys and the corresponding Series as values to create a DataFrame named df. I have used the pd.Series() function to create each Series.